Revit 2026 API

# FootPrintRoofCurtainGrids Property

---

Retrieve all the CurtainGrid objects of a FootPrintRoof.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public CurtainGridSet CurtainGrids { get; }
```
```vb
Public ReadOnly Property CurtainGrids As CurtainGridSet
	Get
```
```cpp
public:
property CurtainGridSet^ CurtainGrids {
	CurtainGridSet^ get ();
}
```
```fsharp
member CurtainGrids : CurtainGridSet with get
```

#### Property Value

CurtainGridSet

Only applicable when the object is a Curtain FootPrintRoof.

#### Reference

FootPrintRoof Class

Autodesk.Revit.DB Namespace